# 3. 기술통계와 요약

In [1]:
from pandas import Series
from pandas import DataFrame

import pandas as pd
import numpy as np

In [5]:
df = DataFrame([[1.4, np.nan], [8.2, 9.1], [np.nan, np.nan], [0.72, -2.3]], index=['a','b','c','d'], columns=['one', 'two'])

In [14]:
df

    one  two
a  1.40  NaN
b  8.20  9.1
c   NaN  NaN
d  0.72 -2.3

In [7]:
# column의 합
df.sum()

one    10.32
two     6.80
dtype: float64

In [8]:
# row의 합
df.sum(axis=1)

a     1.40
b    17.30
c     0.00
d    -1.58
dtype: float64

In [11]:
# NaN값이 있으면 계산 안하는 옵션 (기본 : Ture)
df.mean(axis=1, skipna=False)

a     NaN
b    8.65
c     NaN
d   -0.79
dtype: float64

In [13]:
df.idxmax()

one    b
two    b
dtype: object

In [15]:
df.cumsum()

     one  two
a   1.40  NaN
b   9.60  9.1
c    NaN  NaN
d  10.32  6.8

In [16]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.440000  3.400000
std    4.136279  8.061017
min    0.720000 -2.300000
25%    1.060000  0.550000
50%    1.400000  3.400000
75%    4.800000  6.250000
max    8.200000  9.100000

In [17]:
obj = Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 기술통계와 요약통계
* count : NA값을 제외한 값의 수를 반환
* descibe : 요약통계 반환
* min, max : 최소, 최대값
* argmin, argmax : ??
* idxmin, idxmax : 최소, 최대값의 색인 반환
* quantile : 0부터 1까지의 분위수 ?
* sum / mean / median 
* mad : 평균 값에서 절대 평균편차
* var : 표본 분산
* std : 표본 정규 분산 (표준편차)
* skew : 3차적률(표본 비대칭도)의 값을 구한다
* kurt : 4차적률(표본 첨도)의 값을 구한다
* cumsum : 누적합
* cummin, cummax : 각각 누적 최소 값과 누적 최대값을 계산한다.
* cumprod : 누적 곱을 구한다.
* diff : 1차 산출차를 구한다.(시계열 데이터)
* pct_charge : 퍼센트 변화율 계산

## 3.1 상관관계와 공분산

In [35]:
import pandas as pd
from pandas_datareader import data

ModuleNotFoundError: No module named 'pandas_datareader'

## 3.2 유일 값, 값 세기, 멤버쉽

In [36]:
# 1차원 series의 담긴 값의 정보 추출
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [39]:
# 유일값
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [45]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [50]:
# 값 세기 (default : 내림차순)
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [51]:
# value_counts는 pandas 최상위 메서드 : 어떤 배열이나 구조에서도 사용 가능)
pd.value_counts(obj.values, sort=False) # default값

a    3
c    3
b    2
d    1
dtype: int64

In [52]:
# isin : 불리언 벡터 반환, DataFrame column에서 값을 골라내고 싶을 때 유용하게 사용
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [54]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### 유일값, 값 세기, 버리기 메서드
* unique : Series에서 중복값을 제거하고 유일한 값만 포함하는 배열 반환, 결과는 발견된 순서대로
* value_counts : Series에서 유일 값에 대한 색인값과 도수 계산, default : 내림차순
* isin : Series에서 각 원소가 넘겨받은 연속된 값에 속하는지를 나타내는 불리언배열 반환

In [56]:
data = DataFrame({'Qu1':[1,3,4,3,4],
                  'Qu2':[2,3,1,2,3],
                  'Qu4':[1,5,2,4,4]})

In [57]:
data

   Qu1  Qu2  Qu4
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [58]:
# 여러 row의 히스토그램 구하기
result = data.apply(pd.value_counts).fillna(0)

In [59]:
result

   Qu1  Qu2  Qu4
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0